blog/recommended_media.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Recommended Blogs, Podcasts and Seminars for PhD Candidates in Operations Research</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

                        <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css"> 
</head>
<body>
<div id="content">

<div id="outline-container-org1c91720" class="outline-2">
<h2 id="org1c91720">Introduction</h2>
<div class="outline-text-2" id="text-org1c91720">
<p>
As a freshly-started PhD Candidate in Operations Research (OR), I have read dozens of books and papers over the past several months. While this is a necessity to familiarize myself with the literature, I have also found valuable information in media such as blogs, podcasts and seminars that I would not have been able to get from surveying the academic literature. In particular, reading online discussions and listening to Q&amp;A's have been very helpful to me.
</p>

<p>
In this post, I present my curated list of blogs, podcasts and seminars that are of interests to PhD Candidates in OR.
</p>
</div>
</div>

<div id="outline-container-org9712d2a" class="outline-2">
<h2 id="org9712d2a">Blogs</h2>
<div class="outline-text-2" id="text-org9712d2a">
<p>
Here's a list of my favorite OR blogs:
</p>
<dl class="org-dl">
<dt><a href="https://yetanothermathprogrammingconsultant.blogspot.com/">Yet Another Math Programming Consultant by Erwin Kalvelagen</a></dt><dd>Erwin Kalvelagen works as a full-time consultant. He frequently writes about problems that he encounters on the job and supplements the post with GAMS code and numerical results. Erwin's blogposts are a valuable source of optimization problems and provide practical insights in models/solvers.</dd>

<dt><a href="https://punkrockor.com/">Punk Rock Operations Research by Laura Albert</a></dt><dd>Laura Albert is a professor at the University of Wisconsin-Michigan. Her blog was one of the first blogs on industrial engineering and OR. I particularly like her blog posts on writing about OR.</dd>

<dt><a href="https://orinanobworld.blogspot.com/">OR in an OB world by Paul Rubin</a></dt><dd>Paul Rubin is a professor emeritus at Michigan State University. Most posts cover mathematical programming problems.</dd>
</dl>

<p>
For a larger overview of OR blogs, you can check out this <a href="https://mat.tepper.cmu.edu/blog/index.php/listing-of-or-blogs/">list</a> by Michael Trick or this <a href="https://or.stackexchange.com/questions/5885/recommendations-for-om-blogs">thread</a> on OR StackExchange.
</p>
</div>
</div>

<div id="outline-container-orgd523b0d" class="outline-2">
<h2 id="orgd523b0d">Podcasts</h2>
<div class="outline-text-2" id="text-orgd523b0d">
<p>
I bike a lot to get around in the Netherlands. This makes listening to podcasts a great use of my biking time. Here are two OR podcasts that I recommend:
</p>
<dl class="org-dl">
<dt><a href="https://www.youtube.com/channel/UCKMY2i-ROJjOXCxePFewnkg">Subject to by Anand Subramanian</a></dt><dd><i>Subject to</i> is series of interviews with OR experts hosted by Anand Subramanian. What makes this podcast so great to listen to is that Anand is a well-seasoned OR expert himself and he personally knows most of the interviewees personally. The result is a collection of high-quality interviews both in terms of OR content but also personal stories.</dd>

<dt><a href="https://pubsonline.informs.org/magazine/orms-today/podcasts">INFORMS: Resoundingly Human by Ashley Kilgore</a></dt><dd>A series of interviews with researchers from the field of OR and analytics. The interviews are between 10-30 minutes and highlight the "real-life" impact of research.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgc7b3ff1" class="outline-2">
<h2 id="orgc7b3ff1">Seminars</h2>
<div class="outline-text-2" id="text-orgc7b3ff1">
<p>
Seminars are an effective way to get a good introduction to some new research area or idea. What I like the most about seminars are the Q&amp;A's: the possibility to ask questions to "the author" has helped me to increase my understanding. Below I listed five seminars here that are (1) hosted online and (2) accessible to anyone.
</p>
<dl class="org-dl">
<dt><a href="https://schedulingseminar.com/">Scheduling seminar</a></dt><dd>A bi-weekly seminar to present the newest scheduling research and to survey traditional areas.</dd>
<dt><a href="https://www.euro-online.org/websites/verolog/webinar/">VeRoLog webinar</a></dt><dd>A monthly seminar of plenary talks, paper presentations from academia and/or industry as well as interviews with famous researchers from the VeRoLog (i.e., VRP and logistics) community.</dd>
<dt><a href="https://talks.discreteopt.com/">Discrete Optimization Talks</a></dt><dd>A monthly seminar organized by Aleksandr M. Kazachkov and Elias B. Khalil. on theoretical, computational and applied aspects of integer and combinatorial optimization.</dd>
<dt><a href="https://portals.project.cwi.nl/dutch-optimization-seminar/dutch-optimization-seminar">Dutch Seminar on Optimization</a></dt><dd>A monthly seminar organized by the Dutch Optimization community on topics related to (but not limited to) the theoretical foundations of discrete and continuous optimization.</dd>
<dt><a href="https://cse.umn.edu/isye/isye-seminar-series">ISyE Seminar Series</a></dt><dd>Monthly seminar series organized by the department of Industrial and Systems Engineering, University of Minnesota. Recent videos are uploaded on their <a href="https://www.youtube.com/channel/UCrLq5M3GjRRGYLHBM4Carfg/videos">Youtube</a> channel.</dd>
<dt><a href="https://congreso.us.es/mlneedsmo/">Machine Learning NeEDS Mathematical Optimization</a></dt><dd>Monthly seminar series organized in the field of Data Science and Analytics where mathematical modeling and optimization plays an important role.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgf09d605" class="outline-2">
<h2 id="orgf09d605">Other recommendations</h2>
<div class="outline-text-2" id="text-orgf09d605">
<p>
Here are some other recommendations that may be of interests, but do not belong to any of the categories above.
</p>
<dl class="org-dl">
<dt><a href="https://or.stackexchange.com/">OR StackExchange</a></dt><dd>The OR Stack Exchange board is the place to ask your questions related to OR. It's actively visited by respected members of the OR community, among others Paul Rubin and Erwin Kalvelagen, whose blogs I listed above.</dd>
<dt><a href="https://www.hsu-hh.de/logistik/research/challenges">Optimization Challenges</a></dt><dd>A comprehensive list of optimization challenges and competitions in OR (and some related fields). The list contains all current and previous challenges and is maintained by Martin J. Geiger.</dd>
<dt><a href="https://twitter.com/i/lists/1488062354482999299?s=20&amp;t=_8Fb_UDyeITZRpPQQRReSA">OR Twitter</a></dt><dd>I maintain a following list of people that are involved in OR academia or industry.</dd>
</dl>

<p>
That's it! I hope you enjoy this list of blogs, podcasts and seminars. Note that this list is by no means exhaustive, so feel free to contact me if you have any other suggestions.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
